# Переборные
На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом:

1) Строится двоичная запись числа N.
2) Затем справа дописываются два разряда: символы «01», если число N чётное, и «10», если нечётное.

Полученная таким образом запись (в ней на два разряда больше, чем в записи исходного числа N) является двоичной записью искомого числа R.
Укажите минимальное число R, большее 130, которое может являться результатом работы этого алгоритма. В ответе это число запишите в десятичной системе.
```
n = int(input())            # Получаем число от пользователя
r = bin(n)                  # Переводим число в двоичную систему
print(r)                    # Выводим результат
```
```
n = int(input())            # Получаем число от пользователя
r = bin(n)[2:]              # Переводим в двоичную систему и убираем префикс '0b'
print(r)                    # Выводим результат
```
```
n = int(input())            # Получаем число от пользователя
r = bin(n)[2:]              # Переводим в двоичную систему без префикса '0b'
print(r)                    # Выводим двоичное представление
if n % 2 == 0:              # Если число четное
    r += '01'               # Добавляем в конец '01'
else:                       # Если число нечетное
    r += '10'               # Добавляем в конец '10'
print(r)                    # Выводим измененную строку
```
```
for n in range(1, 100):     # Перебираем числа от 1 до 99
    r = bin(n)[2:]          # Получаем двоичное представление без '0b'
    print(r)                # Выводим двоичное число
    if n % 2 == 0:          # Если число четное
        r += '01'           # Добавляем '01'
    else:                   # Если число нечетное
        r += '10'           # Добавляем '10'
    print(n, r)             # Выводим исходное число и новую двоичную строку
```
```
for n in range(1, 100):     # Перебираем числа от 1 до 99
    r = bin(n)[2:]          # Получаем двоичное представление
    print(r)                # Выводим двоичное число
    if n % 2 == 0:          # Проверяем четность
        r += '01'           # Для четных добавляем '01'
    else:                   # Для нечетных
        r += '10'           # Добавляем '10'
    print(n, int(r, 2))     # Выводим исходное число и результат в десятичной системе
```
```
for n in range(1, 100):     # Перебираем числа от 1 до 99
    r = bin(n)[2:]          # Получаем двоичное представление
    print(r)                # Выводим двоичное число
    if n % 2 == 0:          # Проверяем четность
        r += '01'           # Добавляем '01' для четных
    else:                   # Проверяем нечетность
        r += '10'           # Добавляем '10' для нечетных
    if int(r, 2) > 130:     # Если полученное число больше 130
        print(int(r, 2))    # Выводим его в десятичной системе
```
